create_clock -name clock -period 2 -waveform {0 1} [get_ports "clock"]
set_clock_transition -rise 0.1 [get_clocks "clock"]
set_clock_transition -fall 0.1 [get_clocks "clock"]
set_clock_uncertainty 0.01 [get_ports "clock"]
set_input_delay -max 1.0 -clock clock [all_inputs]
set_output_delay -max 1.0 -clock clock [all_outputs]


